In [31]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [32]:
df=pd.read_csv('C:\\Users\\arif\\OneDrive\\Journal Paper\\Code\\Irshad\\Dataset\\1_Originol_DataSet.csv')
df.head(2)

         Date  HOUR System_load
0  01/01/2015     1        8288
1  01/01/2015     2        8099

In [33]:
print('Data Points= ',len(df))

Data Points=  46608

In [34]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 46608 entries, 0 to 46607
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Date         46608 non-null  object
 1   HOUR         46608 non-null  int64
 2   System_load  46608 non-null  object
dtypes: int64(1), object(2)
memory usage: 1.1+ MB

In [35]:
df['Date']=pd.to_datetime(df['Date'], dayfirst=True, format="%d/%m/%Y")

In [36]:
df['rough']='00:00'
df['hour']=df['HOUR']-1
df["hour_m_s"] = df['hour'].astype(str) +":"+ df["rough"].astype(str)
df["date_and_hour"] = df['Date'].astype(str) +" "+ df["hour_m_s"].astype(str)
del df["hour_m_s"]
del df["rough"]
del df['hour']
del df['HOUR']
del df['Date']
df.head()

  System_load       date_and_hour
0        8288  2015-01-01 0:00:00
1        8099  2015-01-01 1:00:00
2        7994  2015-01-01 2:00:00
3        7965  2015-01-01 3:00:00
4        8120  2015-01-01 4:00:00

In [37]:
df['date_and_hour']=pd.to_datetime(df['date_and_hour'])
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 46608 entries, 0 to 46607
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   System_load    46608 non-null  object
 1   date_and_hour  46608 non-null  datetime64[ns]
dtypes: datetime64[ns](1), object(1)
memory usage: 728.4+ KB

In [38]:
#df.set_index('date_and_hour', inplace=True)
df

      System_load       date_and_hour
0            8288 2015-01-01 00:00:00
1            8099 2015-01-01 01:00:00
2            7994 2015-01-01 02:00:00
3            7965 2015-01-01 03:00:00
4            8120 2015-01-01 04:00:00
...           ...                 ...
46603       16858 2020-04-30 19:00:00
46604       17105 2020-04-30 20:00:00
46605       16824 2020-04-30 21:00:00
46606       16332 2020-04-30 22:00:00
46607       15003 2020-04-30 23:00:00

[46608 rows x 2 columns]

In [39]:
# Drop Duplicates Except the First Occurrence
df.drop_duplicates(subset=['date_and_hour'], keep ='first',  inplace= True)
df

      System_load       date_and_hour
0            8288 2015-01-01 00:00:00
1            8099 2015-01-01 01:00:00
2            7994 2015-01-01 02:00:00
3            7965 2015-01-01 03:00:00
4            8120 2015-01-01 04:00:00
...           ...                 ...
46603       16858 2020-04-30 19:00:00
46604       17105 2020-04-30 20:00:00
46605       16824 2020-04-30 21:00:00
46606       16332 2020-04-30 22:00:00
46607       15003 2020-04-30 23:00:00

[46557 rows x 2 columns]

In [50]:
df.iloc[120:150]

          date_and_hour  System_load
120 2015-01-06 00:00:00       8212.0
121 2015-01-06 01:00:00       8134.0
122 2015-01-06 02:00:00       8014.0
123 2015-01-06 03:00:00       7699.0
124 2015-01-06 04:00:00       7652.0
125 2015-01-06 05:00:00       7947.0
126 2015-01-06 06:00:00       8399.0
127 2015-01-06 07:00:00       8428.0
128 2015-01-06 08:00:00       8083.0
129 2015-01-06 09:00:00       8042.0
130 2015-01-06 10:00:00       8055.0
131 2015-01-06 11:00:00       8282.0
132 2015-01-06 12:00:00       9066.0
133 2015-01-06 13:00:00       9117.0
134 2015-01-06 14:00:00       9088.0
135 2015-01-06 15:00:00       9117.0
136 2015-01-06 16:00:00       9151.0
137 2015-01-06 17:00:00       9455.0
138 2015-01-06 18:00:00       9463.0
139 2015-01-06 19:00:00       9946.0
140 2015-01-06 20:00:00      10209.0
141 2015-01-06 21:00:00       9581.0
142 2015-01-06 22:00:00       8913.0
143 2015-01-06 23:00:00       8806.0
144 2015-01-07 00:00:00       8181.0
145 2015-01-07 01:00:00       8175.0
146 2015-01-07 02:00:00       8053.0
147 2015-01-07 03:00:00       7794.0
148 2015-01-07 04:00:00       7882.0
149 2015-01-07 05:00:00       8423.0

In [ ]:
df.set_index('date_and_hour', inplace=True)
df=df.sort_index(ascending=True)

df.head(1)

NameError: name 'df' is not defined

In [42]:
missing_Timestamp=pd.date_range('2015-1-1','2020-4-30',freq='H').difference(df.index)
print('\nNumber of Missing Timestamp= ',len(missing_Timestamp),'\n')
print(missing_Timestamp.to_list())

Number of Missing Timestamp=  171

[Timestamp('2015-01-07 23:00:00'), Timestamp('2015-01-08 00:00:00'), Timestamp('2015-03-12 02:00:00'), Timestamp('2015-06-05 08:00:00'), Timestamp('2015-06-05 09:00:00'), Timestamp('2015-06-05 10:00:00'), Timestamp('2015-06-05 11:00:00'), Timestamp('2015-06-05 12:00:00'), Timestamp('2015-06-05 13:00:00'), Timestamp('2015-06-05 14:00:00'), Timestamp('2015-06-05 15:00:00'), Timestamp('2015-06-05 16:00:00'), Timestamp('2015-06-05 17:00:00'), Timestamp('2015-06-05 18:00:00'), Timestamp('2015-06-05 19:00:00'), Timestamp('2015-06-05 20:00:00'), Timestamp('2015-06-05 21:00:00'), Timestamp('2015-06-05 22:00:00'), Timestamp('2015-06-05 23:00:00'), Timestamp('2015-06-06 00:00:00'), Timestamp('2015-06-06 01:00:00'), Timestamp('2015-06-06 02:00:00'), Timestamp('2015-06-06 03:00:00'), Timestamp('2015-06-06 04:00:00'), Timestamp('2015-06-06 05:00:00'), Timestamp('2015-06-06 06:00:00'), Timestamp('2015-06-06 07:00:00'), Timestamp('2015-07-03 01:00:00'), Timestamp('2016-01-07 23:00:00'), Timestamp('2016-01-08 00:00:00'), Timestamp('2016-02-29 00:00:00'), Timestamp('2016-02-29 01:00:00'), Timestamp('2016-02-29 02:00:00'), Timestamp('2016-02-29 03:00:00'), Timestamp('2016-02-29 04:00:00'), Timestamp('2016-02-29 05:00:00'), Timestamp('2016-02-29 06:00:00'), Timestamp('2016-02-29 07:00:00'), Timestamp('2016-02-29 08:00:00'), Timestamp('2016-02-29 09:00:00'), Timestamp('2016-02-29 10:00:00'), Timestamp('2016-02-29 11:00:00'), Timestamp('2016-02-29 12:00:00'), Timestamp('2016-02-29 13:00:00'), Timestamp('2016-02-29 14:00:00'), Timestamp('2016-02-29 15:00:00'), Timestamp('2016-02-29 16:00:00'), Timestamp('2016-02-29 17:00:00'), Timestamp('2016-02-29 18:00:00'), Timestamp('2016-02-29 19:00:00'), Timestamp('2016-02-29 20:00:00'), Timestamp('2016-02-29 21:00:00'), Timestamp('2016-02-29 22:00:00'), Timestamp('2016-02-29 23:00:00'), Timestamp('2016-03-12 02:00:00'), Timestamp('2016-06-05 08:00:00'), Timestamp('2016-06-05 09:00:00'), Timestamp('2016-06-05 10:00:00'), Timestamp('2016-06-05 11:00:00'), Timestamp('2016-06-05 12:00:00'), Timestamp('2016-06-05 13:00:00'), Timestamp('2016-06-05 14:00:00'), Timestamp('2016-06-05 15:00:00'), Timestamp('2016-06-05 16:00:00'), Timestamp('2016-06-05 17:00:00'), Timestamp('2016-06-05 18:00:00'), Timestamp('2016-06-05 19:00:00'), Timestamp('2016-06-05 20:00:00'), Timestamp('2016-06-05 21:00:00'), Timestamp('2016-06-05 22:00:00'), Timestamp('2016-06-05 23:00:00'), Timestamp('2016-06-06 00:00:00'), Timestamp('2016-06-06 01:00:00'), Timestamp('2016-06-06 02:00:00'), Timestamp('2016-06-06 03:00:00'), Timestamp('2016-06-06 04:00:00'), Timestamp('2016-06-06 05:00:00'), Timestamp('2016-06-06 06:00:00'), Timestamp('2016-06-06 07:00:00'), Timestamp('2017-01-07 23:00:00'), Timestamp('2017-01-08 00:00:00'), Timestamp('2017-03-12 02:00:00'), Timestamp('2017-06-05 08:00:00'), Timestamp('2017-06-05 09:00:00'), Timestamp('2017-06-05 10:00:00'), Timestamp('2017-06-05 11:00:00'), Timestamp('2017-06-05 12:00:00'), Timestamp('2017-06-05 13:00:00'), Timestamp('2017-06-05 14:00:00'), Timestamp('2017-06-05 15:00:00'), Timestamp('2017-06-05 16:00:00'), Timestamp('2017-06-05 17:00:00'), Timestamp('2017-06-05 18:00:00'), Timestamp('2017-06-05 19:00:00'), Timestamp('2017-06-05 20:00:00'), Timestamp('2017-06-05 21:00:00'), Timestamp('2017-06-05 22:00:00'), Timestamp('2017-06-05 23:00:00'), Timestamp('2017-06-06 00:00:00'), Timestamp('2017-06-06 01:00:00'), Timestamp('2017-06-06 02:00:00'), Timestamp('2017-06-06 03:00:00'), Timestamp('2017-06-06 04:00:00'), Timestamp('2017-06-06 05:00:00'), Timestamp('2017-06-06 06:00:00'), Timestamp('2017-06-06 07:00:00'), Timestamp('2017-07-03 01:00:00'), Timestamp('2018-01-07 23:00:00'), Timestamp('2018-01-08 00:00:00'), Timestamp('2018-03-12 02:00:00'), Timestamp('2018-06-05 08:00:00'), Timestamp('2018-06-05 09:00:00'), Timestamp('2018-06-05 10:00:00'), Timestamp('2018-06-05 11:00:00'), Timestamp('2018-06-05 12:00:00'), Timestamp('2018-06-05 13:00:00'), Timestamp('2018-06-05 14:00:00'), Timestamp('2018-06-05 15:00:00'), Timestamp('2018-06-05 16:00:00'), Timestamp('2018-06-05 17:00:00'), Timestamp('2018-06-05 18:00:00'), Timestamp('2018-06-05 19:00:00'), Timestamp('2018-06-05 20:00:00'), Timestamp('2018-06-05 21:00:00'), Timestamp('2018-06-05 22:00:00'), Timestamp('2018-06-05 23:00:00'), Timestamp('2018-06-06 00:00:00'), Timestamp('2018-06-06 01:00:00'), Timestamp('2018-06-06 02:00:00'), Timestamp('2018-06-06 03:00:00'), Timestamp('2018-06-06 04:00:00'), Timestamp('2018-06-06 05:00:00'), Timestamp('2018-06-06 06:00:00'), Timestamp('2018-06-06 07:00:00'), Timestamp('2018-07-03 01:00:00'), Timestamp('2019-01-09 23:00:00'), Timestamp('2019-01-27 23:00:00'), Timestamp('2019-02-08 23:00:00'), Timestamp('2019-02-10 23:00:00'), Timestamp('2019-02-27 23:00:00'), Timestamp('2019-03-02 23:00:00'), Timestamp('2019-03-20 23:00:00'), Timestamp('2019-04-12 23:00:00'), Timestamp('2019-05-10 23:00:00'), Timestamp('2019-05-16 23:00:00'), Timestamp('2019-05-20 23:00:00'), Timestamp('2019-05-31 23:00:00'), Timestamp('2019-06-02 23:00:00'), Timestamp('2019-07-01 22:00:00'), Timestamp('2019-07-01 23:00:00'), Timestamp('2019-07-05 23:00:00'), Timestamp('2019-07-11 23:00:00'), Timestamp('2019-08-14 00:00:00'), Timestamp('2019-09-01 01:00:00'), Timestamp('2019-10-02 00:00:00'), Timestamp('2019-10-08 01:00:00'), Timestamp('2019-11-10 00:00:00'), Timestamp('2019-12-19 00:00:00'), Timestamp('2019-12-21 00:00:00'), Timestamp('2019-12-24 00:00:00'), Timestamp('2019-12-28 00:00:00'), Timestamp('2020-01-03 23:00:00'), Timestamp('2020-01-11 00:00:00'), Timestamp('2020-01-31 00:00:00'), Timestamp('2020-02-17 01:00:00'), Timestamp('2020-03-22 23:00:00'), Timestamp('2020-03-23 22:00:00'), Timestamp('2020-03-30 22:00:00'), Timestamp('2020-03-30 23:00:00'), Timestamp('2020-04-02 22:00:00'), Timestamp('2020-04-02 23:00:00')]

In [43]:
df = df.resample('H').first().fillna(np.NaN)
missing_Timestamp=pd.date_range('2015-1-1','2020-4-30',freq='H').difference(df.index)
print('\nNumber of Missing Timestamp= ',len(missing_Timestamp),'\n')
print(missing_Timestamp.to_list())

Number of Missing Timestamp=  0

[]

In [44]:
df.reset_index(inplace=True)
len_list=df[df['System_load'].isnull()].index.tolist()
df.iloc[len_list[:len(len_list)]]

            date_and_hour System_load
167   2015-01-07 23:00:00         NaN
168   2015-01-08 00:00:00         NaN
1682  2015-03-12 02:00:00         NaN
3728  2015-06-05 08:00:00         NaN
3729  2015-06-05 09:00:00         NaN
...                   ...         ...
45814 2020-03-23 22:00:00         NaN
45982 2020-03-30 22:00:00         NaN
45983 2020-03-30 23:00:00         NaN
46054 2020-04-02 22:00:00         NaN
46055 2020-04-02 23:00:00         NaN

[171 rows x 2 columns]

In [45]:
print('values are missing at the following indexes:\n',len_list)

values are missing at the following indexes:
 [167, 168, 1682, 3728, 3729, 3730, 3731, 3732, 3733, 3734, 3735, 3736, 3737, 3738, 3739, 3740, 3741, 3742, 3743, 3744, 3745, 3746, 3747, 3748, 3749, 3750, 3751, 4393, 8927, 8928, 10176, 10177, 10178, 10179, 10180, 10181, 10182, 10183, 10184, 10185, 10186, 10187, 10188, 10189, 10190, 10191, 10192, 10193, 10194, 10195, 10196, 10197, 10198, 10199, 10466, 12512, 12513, 12514, 12515, 12516, 12517, 12518, 12519, 12520, 12521, 12522, 12523, 12524, 12525, 12526, 12527, 12528, 12529, 12530, 12531, 12532, 12533, 12534, 12535, 17711, 17712, 19226, 21272, 21273, 21274, 21275, 21276, 21277, 21278, 21279, 21280, 21281, 21282, 21283, 21284, 21285, 21286, 21287, 21288, 21289, 21290, 21291, 21292, 21293, 21294, 21295, 21937, 26471, 26472, 27986, 30032, 30033, 30034, 30035, 30036, 30037, 30038, 30039, 30040, 30041, 30042, 30043, 30044, 30045, 30046, 30047, 30048, 30049, 30050, 30051, 30052, 30053, 30054, 30055, 30697, 35279, 35711, 35999, 36047, 36455, 36527, 36959, 37511, 38183, 38327, 38423, 38687, 38735, 39430, 39431, 39527, 39671, 40464, 40897, 41640, 41785, 42576, 43512, 43560, 43632, 43728, 43895, 44064, 44544, 44953, 45791, 45814, 45982, 45983, 46054, 46055]

In [46]:
df['System_load']=pd.to_numeric(df['System_load'],errors='coerce')

In [47]:
df.isnull().sum()

date_and_hour      0
System_load      173
dtype: int64

In [48]:
df.to_csv('C:\\Users\\arif\\OneDrive\\Journal Paper\\Code\\Irshad\\Dataset\\2_Missing_Values_Identified.csv',index=False)

# Practice

In [17]:
df['Hour']=df['date_and_hour'].dt.hour
df['Day']=df['date_and_hour'].dt.day
df['Month']=df['date_and_hour'].dt.month
df['Year']=df['date_and_hour'].dt.year
df['Day_Of_Week']=df['date_and_hour'].dt.weekday
df['date_and_hour']
#df['Date']=df['Year'].astype(str) + "/" + df['Month'].astype(str) +"/"+ df['Day'].astype(str)
#df['Date']=pd.to_datetime(df['Date'])
#df.set_index('Date', inplace=True)
df.head()

        date_and_hour  System_load  Hour  Day  Month  Year  Day_Of_Week
0 2015-01-01 00:00:00       8288.0     0    1      1  2015            3
1 2015-01-01 01:00:00       8099.0     1    1      1  2015            3
2 2015-01-01 02:00:00       7994.0     2    1      1  2015            3
3 2015-01-01 03:00:00       7965.0     3    1      1  2015            3
4 2015-01-01 04:00:00       8120.0     4    1      1  2015            3

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 46608 entries, 0 to 46607
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Date         46608 non-null  object
 1   HOUR         46608 non-null  int64
 2   System_load  46608 non-null  object
dtypes: int64(1), object(2)
memory usage: 1.1+ MB

In [15]:
before_legth=len(df)
before_legth

46608

In [16]:
df['Date']=pd.to_datetime(df['Date'], dayfirst=True, format="%d/%m/%Y")

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 46608 entries, 0 to 46607
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Date         46608 non-null  datetime64[ns]
 1   HOUR         46608 non-null  int64
 2   System_load  46608 non-null  object
dtypes: datetime64[ns](1), int64(1), object(1)
memory usage: 1.1+ MB

In [18]:
df['rough']='00:00'
df['hour']=df['HOUR']-1
df["hour_m_s"] = df['hour'].astype(str) +":"+ df["rough"].astype(str)
df["date_and_hour"] = df['Date'].astype(str) +" "+ df["hour_m_s"].astype(str)
del df["hour_m_s"]
del df["rough"]
del df['hour']

In [19]:
df

            Date  HOUR System_load        date_and_hour
0     2015-01-01     1        8288   2015-01-01 0:00:00
1     2015-01-01     2        8099   2015-01-01 1:00:00
2     2015-01-01     3        7994   2015-01-01 2:00:00
3     2015-01-01     4        7965   2015-01-01 3:00:00
4     2015-01-01     5        8120   2015-01-01 4:00:00
...          ...   ...         ...                  ...
46603 2020-04-30    20       16858  2020-04-30 19:00:00
46604 2020-04-30    21       17105  2020-04-30 20:00:00
46605 2020-04-30    22       16824  2020-04-30 21:00:00
46606 2020-04-30    23       16332  2020-04-30 22:00:00
46607 2020-04-30    24       15003  2020-04-30 23:00:00

[46608 rows x 4 columns]

In [20]:
df['date_and_hour']=pd.to_datetime(df['date_and_hour'])
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 46608 entries, 0 to 46607
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Date           46608 non-null  datetime64[ns]
 1   HOUR           46608 non-null  int64
 2   System_load    46608 non-null  object
 3   date_and_hour  46608 non-null  datetime64[ns]
dtypes: datetime64[ns](2), int64(1), object(1)
memory usage: 1.4+ MB

In [21]:
df.set_index('date_and_hour', inplace=True)
df=df.sort_index(ascending=True)
df

                          Date  HOUR System_load
date_and_hour
2015-01-01 00:00:00 2015-01-01     1        8288
2015-01-01 01:00:00 2015-01-01     2        8099
2015-01-01 02:00:00 2015-01-01     3        7994
2015-01-01 03:00:00 2015-01-01     4        7965
2015-01-01 04:00:00 2015-01-01     5        8120
...                        ...   ...         ...
2020-04-30 19:00:00 2020-04-30    20       16858
2020-04-30 20:00:00 2020-04-30    21       17105
2020-04-30 21:00:00 2020-04-30    22       16824
2020-04-30 22:00:00 2020-04-30    23       16332
2020-04-30 23:00:00 2020-04-30    24       15003

[46608 rows x 3 columns]

In [22]:
del df['Date']
del df['HOUR']
df

                    System_load
date_and_hour
2015-01-01 00:00:00        8288
2015-01-01 01:00:00        8099
2015-01-01 02:00:00        7994
2015-01-01 03:00:00        7965
2015-01-01 04:00:00        8120
...                         ...
2020-04-30 19:00:00       16858
2020-04-30 20:00:00       17105
2020-04-30 21:00:00       16824
2020-04-30 22:00:00       16332
2020-04-30 23:00:00       15003

[46608 rows x 1 columns]

In [23]:
a=pd.date_range('2015-1-1','2020-4-30',freq='H').difference(df.index)
len(a)#missing points

171

In [24]:
df = df.resample('H').first().fillna(np.NaN)
a = pd.date_range('2015-1-1','2020-4-30',freq='H').difference(df.index)
len(a)#missing points

0

In [25]:
missing_data_was=len(df)-before_legth
print('missing_data_was= ',missing_data_was)

missing_data_was=  120

In [26]:
df[164:170]

                    System_load
date_and_hour
2015-01-07 20:00:00        9725
2015-01-07 21:00:00        8990
2015-01-07 22:00:00        8347
2015-01-07 23:00:00         NaN
2015-01-08 00:00:00         NaN
2015-01-08 01:00:00        8094

In [13]:
df

            Date  HOUR System_load       date_and_hour
0     2015-01-01     1        8288 2015-01-01 00:00:00
1     2015-01-01     2        8099 2015-01-01 01:00:00
2     2015-01-01     3        7994 2015-01-01 02:00:00
3     2015-01-01     4        7965 2015-01-01 03:00:00
4     2015-01-01     5        8120 2015-01-01 04:00:00
...          ...   ...         ...                 ...
46603 2020-04-30    20       16858 2020-04-30 19:00:00
46604 2020-04-30    21       17105 2020-04-30 20:00:00
46605 2020-04-30    22       16824 2020-04-30 21:00:00
46606 2020-04-30    23       16332 2020-04-30 22:00:00
46607 2020-04-30    24       15003 2020-04-30 23:00:00

[46608 rows x 4 columns]

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 46608 entries, 0 to 46607
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Date           46608 non-null  datetime64[ns]
 1   HOUR           46608 non-null  int64
 2   System_load    46608 non-null  object
 3   date_and_hour  46608 non-null  datetime64[ns]
dtypes: datetime64[ns](2), int64(1), object(1)
memory usage: 1.4+ MB

# Practice work

In [57]:
df = pd.read_csv('E:\\DataSets\\ShortTermLF\\NTDC\\Originol_DataSetNaN.csv')
#df = pd.read_csv('E:\\DataSets\\ShortTermLF\\NTDC\\Dataset1.csv')

In [58]:
df.HOUR.dtype

dtype('int64')

In [59]:
df['rough']='00:00'

In [60]:
df['hour']=df['HOUR']-1

In [61]:
df.head(2)

         Date  HOUR  System_load  rough  hour
0  01/01/2015     1         8288  00:00     0
1  01/01/2015     2         8099  00:00     1

In [62]:
df["hour_m_s"] = df['hour'].astype(str) +":"+ df["rough"].astype(str)
del df["rough"]
del df['hour']

In [63]:
df.head(2)

         Date  HOUR  System_load hour_m_s
0  01/01/2015     1         8288  0:00:00
1  01/01/2015     2         8099  1:00:00

In [64]:
# Using + operator to combine two columns
df["date_and_hour"] = df['Date'].astype(str) +" "+ df["hour_m_s"].astype(str)
del df['Date']
del df["hour_m_s"]

In [65]:
df.head(2)

   HOUR  System_load       date_and_hour
0     1         8288  01/01/2015 0:00:00
1     2         8099  01/01/2015 1:00:00

In [66]:
df['date_and_hour']=pd.to_datetime(df['date_and_hour'])

In [67]:
df.head(25)

    HOUR  System_load       date_and_hour
0      1         8288 2015-01-01 00:00:00
1      2         8099 2015-01-01 01:00:00
2      3         7994 2015-01-01 02:00:00
3      4         7965 2015-01-01 03:00:00
4      5         8120 2015-01-01 04:00:00
5      6         8462 2015-01-01 05:00:00
6      7         9200 2015-01-01 06:00:00
7      8         9657 2015-01-01 07:00:00
8      9        10032 2015-01-01 08:00:00
9     10        10072 2015-01-01 09:00:00
10    11         9932 2015-01-01 10:00:00
11    12         9980 2015-01-01 11:00:00
12    13         9392 2015-01-01 12:00:00
13    14         9488 2015-01-01 13:00:00
14    15         9270 2015-01-01 14:00:00
15    16         9209 2015-01-01 15:00:00
16    17         9369 2015-01-01 16:00:00
17    18         9435 2015-01-01 17:00:00
18    19        10065 2015-01-01 18:00:00
19    20         9990 2015-01-01 19:00:00
20    21         9689 2015-01-01 20:00:00
21    22         9312 2015-01-01 21:00:00
22    23         9049 2015-01-01 22:00:00
23    24         8760 2015-01-01 23:00:00
24     1         8291 2015-02-01 00:00:00

In [68]:
df.set_index('date_and_hour', inplace=True)

In [69]:
df.head(2)

                     HOUR  System_load
date_and_hour
2015-01-01 00:00:00     1         8288
2015-01-01 01:00:00     2         8099

In [ ]:
a=pd.date_range('2015-1-1','2020-4-30',freq='H').difference(df.index)
len(a)

In [41]:
print('data missing in 2015\n', a[0:50])
print('\nmissing points= ',len(a[0:28]))

data missing in 2015
 DatetimeIndex(['2015-03-07 01:00:00', '2015-05-06 08:00:00',
               '2015-05-06 09:00:00', '2015-05-06 10:00:00',
               '2015-05-06 11:00:00', '2015-05-06 12:00:00',
               '2015-05-06 13:00:00', '2015-05-06 14:00:00',
               '2015-05-06 15:00:00', '2015-05-06 16:00:00',
               '2015-05-06 17:00:00', '2015-05-06 18:00:00',
               '2015-05-06 19:00:00', '2015-05-06 20:00:00',
               '2015-05-06 21:00:00', '2015-05-06 22:00:00',
               '2015-05-06 23:00:00', '2015-06-06 00:00:00',
               '2015-06-06 01:00:00', '2015-06-06 02:00:00',
               '2015-06-06 03:00:00', '2015-06-06 04:00:00',
               '2015-06-06 05:00:00', '2015-06-06 06:00:00',
               '2015-06-06 07:00:00', '2015-07-01 23:00:00',
               '2015-08-01 00:00:00', '2015-12-03 02:00:00',
               '2016-02-29 00:00:00', '2016-02-29 01:00:00',
               '2016-02-29 02:00:00', '2016-02-29 03:00:00',
               '2016-02-29 04:00:00', '2016-02-29 05:00:00',
               '2016-02-29 06:00:00', '2016-02-29 07:00:00',
               '2016-02-29 08:00:00', '2016-02-29 09:00:00',
               '2016-02-29 10:00:00', '2016-02-29 11:00:00',
               '2016-02-29 12:00:00', '2016-02-29 13:00:00',
               '2016-02-29 14:00:00', '2016-02-29 15:00:00',
               '2016-02-29 16:00:00', '2016-02-29 17:00:00',
               '2016-02-29 18:00:00', '2016-02-29 19:00:00',
               '2016-02-29 20:00:00', '2016-02-29 21:00:00'],
              dtype='datetime64[ns]', freq=None)

missing points=  28

In [42]:
print('data missing in 2016\n\n', a[28:79])
print('\nmissing points= ',len(a[28:79]))

data missing in 2016

 DatetimeIndex(['2016-02-29 00:00:00', '2016-02-29 01:00:00',
               '2016-02-29 02:00:00', '2016-02-29 03:00:00',
               '2016-02-29 04:00:00', '2016-02-29 05:00:00',
               '2016-02-29 06:00:00', '2016-02-29 07:00:00',
               '2016-02-29 08:00:00', '2016-02-29 09:00:00',
               '2016-02-29 10:00:00', '2016-02-29 11:00:00',
               '2016-02-29 12:00:00', '2016-02-29 13:00:00',
               '2016-02-29 14:00:00', '2016-02-29 15:00:00',
               '2016-02-29 16:00:00', '2016-02-29 17:00:00',
               '2016-02-29 18:00:00', '2016-02-29 19:00:00',
               '2016-02-29 20:00:00', '2016-02-29 21:00:00',
               '2016-02-29 22:00:00', '2016-02-29 23:00:00',
               '2016-05-06 08:00:00', '2016-05-06 09:00:00',
               '2016-05-06 10:00:00', '2016-05-06 11:00:00',
               '2016-05-06 12:00:00', '2016-05-06 13:00:00',
               '2016-05-06 14:00:00', '2016-05-06 15:00:00',
               '2016-05-06 16:00:00', '2016-05-06 17:00:00',
               '2016-05-06 18:00:00', '2016-05-06 19:00:00',
               '2016-05-06 20:00:00', '2016-05-06 21:00:00',
               '2016-05-06 22:00:00', '2016-05-06 23:00:00',
               '2016-06-06 00:00:00', '2016-06-06 01:00:00',
               '2016-06-06 02:00:00', '2016-06-06 03:00:00',
               '2016-06-06 04:00:00', '2016-06-06 05:00:00',
               '2016-06-06 06:00:00', '2016-06-06 07:00:00',
               '2016-07-01 23:00:00', '2016-08-01 00:00:00',
               '2016-12-03 02:00:00'],
              dtype='datetime64[ns]', freq=None)

missing points=  51

In [43]:
print('data missing in 2017\n\n', a[79:107])
print('\nmissing points= ',len(a[79:107]))

data missing in 2017

 DatetimeIndex(['2017-03-07 01:00:00', '2017-05-06 08:00:00',
               '2017-05-06 09:00:00', '2017-05-06 10:00:00',
               '2017-05-06 11:00:00', '2017-05-06 12:00:00',
               '2017-05-06 13:00:00', '2017-05-06 14:00:00',
               '2017-05-06 15:00:00', '2017-05-06 16:00:00',
               '2017-05-06 17:00:00', '2017-05-06 18:00:00',
               '2017-05-06 19:00:00', '2017-05-06 20:00:00',
               '2017-05-06 21:00:00', '2017-05-06 22:00:00',
               '2017-05-06 23:00:00', '2017-06-06 00:00:00',
               '2017-06-06 01:00:00', '2017-06-06 02:00:00',
               '2017-06-06 03:00:00', '2017-06-06 04:00:00',
               '2017-06-06 05:00:00', '2017-06-06 06:00:00',
               '2017-06-06 07:00:00', '2017-07-01 23:00:00',
               '2017-08-01 00:00:00', '2017-12-03 02:00:00'],
              dtype='datetime64[ns]', freq=None)

missing points=  28

In [44]:
print('data missing in 2018\n\n', a[107:135])
print('\nmissing points= ',len(a[107:135]))

data missing in 2018

 DatetimeIndex(['2018-03-07 01:00:00', '2018-05-06 08:00:00',
               '2018-05-06 09:00:00', '2018-05-06 10:00:00',
               '2018-05-06 11:00:00', '2018-05-06 12:00:00',
               '2018-05-06 13:00:00', '2018-05-06 14:00:00',
               '2018-05-06 15:00:00', '2018-05-06 16:00:00',
               '2018-05-06 17:00:00', '2018-05-06 18:00:00',
               '2018-05-06 19:00:00', '2018-05-06 20:00:00',
               '2018-05-06 21:00:00', '2018-05-06 22:00:00',
               '2018-05-06 23:00:00', '2018-06-06 00:00:00',
               '2018-06-06 01:00:00', '2018-06-06 02:00:00',
               '2018-06-06 03:00:00', '2018-06-06 04:00:00',
               '2018-06-06 05:00:00', '2018-06-06 06:00:00',
               '2018-06-06 07:00:00', '2018-07-01 23:00:00',
               '2018-08-01 00:00:00', '2018-12-03 02:00:00'],
              dtype='datetime64[ns]', freq=None)

missing points=  28

In [45]:
print('data missing in 2019\n\n', a[135:161])
print('\nmissing points= ',len(a[135:161]))

data missing in 2019

 DatetimeIndex(['2019-01-07 22:00:00', '2019-01-07 23:00:00',
               '2019-01-09 01:00:00', '2019-01-27 23:00:00',
               '2019-02-03 23:00:00', '2019-02-06 23:00:00',
               '2019-02-10 00:00:00', '2019-02-27 23:00:00',
               '2019-03-20 23:00:00', '2019-05-07 23:00:00',
               '2019-05-16 23:00:00', '2019-05-20 23:00:00',
               '2019-05-31 23:00:00', '2019-08-02 23:00:00',
               '2019-08-10 01:00:00', '2019-08-14 00:00:00',
               '2019-09-01 23:00:00', '2019-10-02 23:00:00',
               '2019-10-05 23:00:00', '2019-10-11 00:00:00',
               '2019-11-07 23:00:00', '2019-12-04 23:00:00',
               '2019-12-19 00:00:00', '2019-12-21 00:00:00',
               '2019-12-24 00:00:00', '2019-12-28 00:00:00'],
              dtype='datetime64[ns]', freq=None)

missing points=  26

In [46]:
print('data missing in 2020\n\n', a[161:])
print('\nmissing points= ',len(a[161:]))

data missing in 2020

 DatetimeIndex(['2020-01-05 00:00:00', '2020-01-05 01:00:00',
               '2020-01-05 02:00:00', '2020-01-05 03:00:00',
               '2020-01-05 04:00:00', '2020-01-05 05:00:00',
               '2020-01-05 06:00:00', '2020-01-05 07:00:00',
               '2020-01-05 08:00:00', '2020-01-05 09:00:00',
               ...
               '2020-04-12 14:00:00', '2020-04-12 15:00:00',
               '2020-04-12 16:00:00', '2020-04-12 17:00:00',
               '2020-04-12 18:00:00', '2020-04-12 19:00:00',
               '2020-04-12 20:00:00', '2020-04-12 21:00:00',
               '2020-04-12 22:00:00', '2020-04-12 23:00:00'],
              dtype='datetime64[ns]', length=777, freq=None)

missing points=  777

# Practice

In [3]:
import pandas as pd
data=pd.read_csv('C:\\Users\\arif\\OneDrive\\Journal Paper\\Code\\Hasant code\\1_process_originol_datset_to_find_number_of_missing_points\\1_Dataset_ready_for_filling.csv')
data = data[["System_load"]]

In [4]:
data

      System_load
0            8288
1            8099
2            7994
3            7965
4            8120
...           ...
46723       16858
46724       17105
46725       16824
46726       16332
46727       15003

[46728 rows x 1 columns]

In [7]:
data[data["System_load"].isnull()]

      System_load
167           NaN
168           NaN
1682          NaN
3728          NaN
3729          NaN
...           ...
45814         NaN
45982         NaN
45983         NaN
46054         NaN
46055         NaN

[171 rows x 1 columns]

In [ ]:
import pandas as pd
data=pd.read_csv('C:\\Users\\arif\\OneDrive\\Journal Paper\\Code\\Hasant code\\1_process_originol_datset_to_find_number_of_missing_points\\1_Dataset_ready_for_filling.csv')
data = data[["System_load"]]
test_data = data[data["System_load"].isnull()]
data.dropna(inplace=True)
x_train = data.drop("Age", axis=1)
x_test = test_data.drop("Age", axis=1)
y_train = data["Age"]